pandas implimentaion

In [1]:
import pandas as pd

In [2]:
data = {
    'Name': ['Ramesh', 'Mahesh', 'Suresh'],
    'Age': [25, 30, 35],
    'City': ['Bangalore', 'Mumbai', 'Delhi']
}

In [3]:
df = pd.DataFrame(data)

In [4]:
df.head(2)

     Name  Age       City
0  Ramesh   25  Bangalore
1  Mahesh   30     Mumbai

In [5]:
df['Age']

0    25
1    30
2    35
Name: Age, dtype: int64

In [6]:
df.loc[(df['Age']>26)]

     Name  Age    City
1  Mahesh   30  Mumbai
2  Suresh   35   Delhi

In [7]:
df['Country']='India'

In [8]:
df

     Name  Age       City Country
0  Ramesh   25  Bangalore   India
1  Mahesh   30     Mumbai   India
2  Suresh   35      Delhi   India

In [9]:
data1 = {
    'Name': ['Ramesh', 'Mahesh', 'Suresh'],
    'Age': [25, None, 35],
    'City': ['Bangalore', 'Mumbai', 'Delhi']
}

In [10]:
df2= pd.DataFrame(data1)

In [11]:
df2

     Name   Age       City
0  Ramesh  25.0  Bangalore
1  Mahesh   NaN     Mumbai
2  Suresh  35.0      Delhi

In [12]:
mean = df2['Age'].mean(skipna=True)

In [13]:
mean

30.0

In [14]:
df2['Age'].fillna(mean, inplace=True)

C:\Users\prath\AppData\Local\Temp\ipykernel_15884\3101574161.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df2['Age'].fillna(mean, inplace=True)

In [15]:
df2

     Name   Age       City
0  Ramesh  25.0  Bangalore
1  Mahesh  30.0     Mumbai
2  Suresh  35.0      Delhi